# Domácí úkol č.10 - Zaměstnanci a Projekty
Povinná část - Zadání 1:

In [76]:
import pandas

Uvažuj, že zpracováváš analýzu pro softwarovou firmu. Firma má kanceláře v Praze, Plzni a Liberci. Seznam zaměstnanců pro jednotlivé kanceláře najdeš v souborech zam_praha.csv, zam_plzeň.csv a zam_liberec.csv.

Načti data o zaměstnancích z CSV souborů do tabulek (DataFrame). Ke každé tabulce přidej nový sloupec mesto, které bude obsahovat informaci o tom, ve kterém městě zaměstnanec pracuje.

In [77]:
zam_liberec = pandas.read_csv('zam_liberec.txt')
zam_liberec["mesto"] = "Liberec"
#zam_liberec.shape
#zam_liberec.columns
zam_liberec.info() # 11 zaznamu
#zam_liberec

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   jmeno              11 non-null     object
 1   prijimeni          11 non-null     object
 2   telefonni_cislo    11 non-null     object
 3   cislo_zamestnance  11 non-null     int64
 4   mesto              11 non-null     object
dtypes: int64(1), object(4)
memory usage: 568.0+ bytes

In [78]:
zam_plzeň = pandas.read_csv('zam_plzeň.txt')
zam_plzeň["mesto"] = "Plzeň"
#zam_plzeň.shape
#zam_plzeň.columns
zam_plzeň.info() # 16 zaznamu
#zam_plzeň

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   jmeno              16 non-null     object
 1   prijimeni          16 non-null     object
 2   telefonni_cislo    16 non-null     object
 3   cislo_zamestnance  16 non-null     int64
 4   mesto              16 non-null     object
dtypes: int64(1), object(4)
memory usage: 768.0+ bytes

In [79]:
zam_praha = pandas.read_csv('zam_praha.txt')
zam_praha["mesto"] = "Praha"
#zam_praha.shape
#zam_praha.columns
zam_praha.info() # 29 zaznamu (11+16+29)
#zam_praha

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   jmeno              29 non-null     object
 1   prijimeni          29 non-null     object
 2   telefonni_cislo    29 non-null     object
 3   cislo_zamestnance  29 non-null     int64
 4   mesto              29 non-null     object
dtypes: int64(1), object(4)
memory usage: 1.3+ KB

Vytvoř novou tabulku zamestnanci a ulož do ní informace o všech zaměstnancích (operace concat).

In [80]:
zamestnanci = pandas.concat([zam_liberec, zam_plzeň, zam_praha], ignore_index=True) # nebereme v uvahu indexi z puvodnich tabulek
zamestnanci.info() # 56 zaznamu ok  (11+16+29 = 56)
#zamestnanci

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56 entries, 0 to 55
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   jmeno              56 non-null     object
 1   prijimeni          56 non-null     object
 2   telefonni_cislo    56 non-null     object
 3   cislo_zamestnance  56 non-null     int64
 4   mesto              56 non-null     object
dtypes: int64(1), object(4)
memory usage: 2.3+ KB

Ze souboru platy_2021_02.csv načti platy zaměstnanců za únor 2021. Propoj tabulku (operace join) s platy a tabulku se zaměstnanci pomocí sloupce cislo_zamestnance.

Načtení tabulky platy_2021_02.csv

In [81]:
platy_2021_02 = pandas.read_csv('platy_2021_02.txt')
platy_2021_02.info() # 43 zaznamu
#platy_2021_02

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43 entries, 0 to 42
Data columns (total 2 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   cislo_zamestnance  43 non-null     int64
 1   plat               43 non-null     float64
dtypes: float64(1), int64(1)
memory usage: 816.0 bytes

Propojení tabulek platy_2021_02 a zamestnanci přes cislo_zamestnance

In [82]:
zamestnanci_platy_2021_02 = pandas.merge(zamestnanci, platy_2021_02, on=['cislo_zamestnance'])
#zamestnanci_platy_2021_02
zamestnanci_platy_2021_02.info() #43 zaznamu ok

<class 'pandas.core.frame.DataFrame'>
Int64Index: 43 entries, 0 to 42
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   jmeno              43 non-null     object
 1   prijimeni          43 non-null     object
 2   telefonni_cislo    43 non-null     object
 3   cislo_zamestnance  43 non-null     int64
 4   mesto              43 non-null     object
 5   plat               43 non-null     float64
dtypes: float64(1), int64(1), object(4)
memory usage: 2.4+ KB

Porovnej rozměry tabulek před spojením a po spojení. Pokud nemá některý zaměstnanec plat za únor, znamená to, že v naší firmě již nepracuje.

In [83]:
platy_2021_02.info() # 43
zamestnanci_platy_2021_02.info()  # 43
zamestnanci.info()  # 56

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43 entries, 0 to 42
Data columns (total 2 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   cislo_zamestnance  43 non-null     int64
 1   plat               43 non-null     float64
dtypes: float64(1), int64(1)
memory usage: 816.0 bytes
<class 'pandas.core.frame.DataFrame'>
Int64Index: 43 entries, 0 to 42
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   jmeno              43 non-null     object
 1   prijimeni          43 non-null     object
 2   telefonni_cislo    43 non-null     object
 3   cislo_zamestnance  43 non-null     int64
 4   mesto              43 non-null     object
 5   plat               43 non-null     float64
dtypes: float64(1), int64(1), object(4)
memory usage: 2.4+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56 entries, 0 to 55
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   jmeno              56 non-null     object
 1   prijimeni          56 non-null     object
 2   telefonni_cislo    56 non-null     object
 3   cislo_zamestnance  56 non-null     int64
 4   mesto              56 non-null     object
dtypes: int64(1), object(4)
memory usage: 2.3+ KB

to znamená, že v únoru nepracuje již 13 zamestnanců

pro me kontrola kolik v kazdem meste odeslo zamestnancu v unoru

In [84]:
zamestnanci_platy_2021_02.groupby("mesto")["cislo_zamestnance"].count()
#zamestnanci.groupby("mesto").count()

mesto
Liberec     8
Plzeň      14
Praha      21
Name: cislo_zamestnance, dtype: int64

a to v Liberci - 3, Plzni - 2 a Praze - 8 (3+2+8=13)

Spočti průměrný plat zaměstnanců v jednotlivých kancelářích.
Zadání 2

In [85]:
zamestnanci_platy_2021_02.groupby("mesto")['plat'].mean().round(2)

mesto
Liberec    43775.00
Plzeň      44792.86
Praha      43295.24
Name: plat, dtype: float64

Povinná část - Zadání 2:

Pokračuj ve své práci pro softwarovou firmu. Ze souboru vykazy.csv načti informace o výkazech na projekty pro jednoho vybraného zákazníka.

Načti data ze souboru a ulož je do tabulky.

In [86]:
vykazy = pandas.read_csv('vykazy.txt')
vykazy.info()
vykazy.head(2)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27 entries, 0 to 26
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        27 non-null     object
 1   hours       27 non-null     float64
 2   project     27 non-null     object
 3   emloyee_id  27 non-null     int64
dtypes: float64(1), int64(1), object(2)
memory usage: 992.0+ bytes

         date  hours project  emloyee_id
0  2021-02-01    2.5     F30          13
1  2021-02-01    3.4     W05          70

Proveď agregaci a zjisti celkový počet vykázaných hodin za jednotlivé projekty.

In [87]:
celkem_projekt=vykazy.groupby("project")['hours'].sum().reset_index()
celkem_projekt

  project  hours
0     F30   21.5
1     JL9    2.1
2     TE1   16.0
3     W05   30.5
4     YLI   31.0

Bonus 1:

Ulož do proměnné počet zaměstnanců, kteří v naší firmě již nepracují.

In [88]:
pocet_ex_zam_obdobi = zamestnanci['cislo_zamestnance'].count()-zamestnanci_platy_2021_02['cislo_zamestnance'].count()
pocet_ex_zam_obdobi

13

V rámci úspory se IT oddělení rozhodlo prověřit licence přidělené zaměstnancům, kteří ve firmě již nepracují. Vytvoř samostatnou tabulku, která obsahuje jména zaměstnanců, kteří ve firmě již nepracují. Tabulku ulož do souboru CSV.

provedla jsem nove spojeni (zamestnanci a platy), abych tam mela i NaN hodnoty a to pomoci how="outer". A toto df jsem pouzila pro reseni tohoto ukolu.

In [89]:
zamestnanci_platy_2021_02_nove = pandas.merge(zamestnanci, platy_2021_02, on=['cislo_zamestnance'], how="outer")
zamestnanci_platy_2021_02_nove.info()
#zamestnanci_platy_2021_02_nove.head(6)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 56 entries, 0 to 55
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   jmeno              56 non-null     object
 1   prijimeni          56 non-null     object
 2   telefonni_cislo    56 non-null     object
 3   cislo_zamestnance  56 non-null     int64
 4   mesto              56 non-null     object
 5   plat               43 non-null     float64
dtypes: float64(1), int64(1), object(4)
memory usage: 3.1+ KB

In [90]:
byvaly_zamestnanci = zamestnanci_platy_2021_02_nove[zamestnanci_platy_2021_02_nove["plat"].isna()]
#byvaly_zamestnanci.info()
byvaly_zamestnanci

        jmeno prijimeni   telefonni_cislo  cislo_zamestnance    mesto  plat
3    Jennifer     Brown       775 545 190                 86  Liberec   NaN
5      Robert    Macias  +421 49 929 6856                 88  Liberec   NaN
10       Ivan    Bartoš       603 226 051                 99  Liberec   NaN
15   Jindřich    Howell  +421 39 043 0948                 10    Plzeň   NaN
16  Alexander  Martinez       721 195 689                 13    Plzeň   NaN
31     Marcel     Hájek  +421 902 928 669                 35    Praha   NaN
39   Karolína     Short       721 589 083                 53    Praha   NaN
40   Michelle   Vlčková  +421 41 720 7806                 54    Praha   NaN
43       John    Bailey       775 021 116                 58    Praha   NaN
44    William   Shelton  +421 47 745 8219                 60    Praha   NaN
45  Miroslava    Veselá       774 029 254                 62    Praha   NaN
48     Nathan   Svoboda       728 710 923                 66    Praha   NaN
51     Robert      Říha       727 351 984                 72    Praha   NaN

In [91]:
byvaly_zamestnanci.to_csv('byvaly_zamestnanci.csv', index=False)

Bonus 2:

Propoj tabulku s výkazy s tabulkou se zaměstnanci, kterou jsi vytvořil(a) v předchozím cvičení.

nejprve jsem si prejmenovala sloupec ve vykazech a tuto novou df jsem pouzila pro spojeni zamestnanci, a tato nova df byla pouzita pro reseni ukolu

In [92]:
vykazy_nove = vykazy.rename(columns={'emloyee_id': 'cislo_zamestnance'})
#vykazy_nove.head(6)
vykazy_nove.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27 entries, 0 to 26
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   date               27 non-null     object
 1   hours              27 non-null     float64
 2   project            27 non-null     object
 3   cislo_zamestnance  27 non-null     int64
dtypes: float64(1), int64(1), object(2)
memory usage: 992.0+ bytes

In [93]:
zamestnanci_projekty = pandas.merge(zamestnanci, vykazy_nove, on=['cislo_zamestnance'], how="outer")
zamestnanci_projekty.info()
#ruzne kontroly zda ok
#zamestnanci_projekty[zamestnanci_projekty["project"].isna()].info()
# zamestnanci_projekty.groupby("mesto")["cislo_zamestnance"].count()
#zamestnanci_projekty.groupby("cislo_zamestnance")["mesto"].count().sort_values().tail(10) #kontrola opakovani id v projektu
#zamestnanci_projekty

<class 'pandas.core.frame.DataFrame'>
Int64Index: 62 entries, 0 to 61
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   jmeno              62 non-null     object
 1   prijimeni          62 non-null     object
 2   telefonni_cislo    62 non-null     object
 3   cislo_zamestnance  62 non-null     int64
 4   mesto              62 non-null     object
 5   date               27 non-null     object
 6   hours              27 non-null     float64
 7   project            27 non-null     object
dtypes: float64(1), int64(1), object(6)
memory usage: 4.4+ KB

Následně proveď statistiku vykázaných hodin za jednotlivé kanceláře, tj. spočítej celkový počet hodin vykázaný zaměstnanci jednotlivých kanceláří na projekty daného zákazníka.

vytvoreni nove df ze zamestnanci_projekty bez hodnot NaN na radcich pro nasledny ukol

In [94]:
zamestnanci_projekty_nove = zamestnanci_projekty.dropna(subset=["project"])
zamestnanci_projekty_nove.info()
#zamestnanci_projekty_nove

<class 'pandas.core.frame.DataFrame'>
Int64Index: 27 entries, 0 to 57
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   jmeno              27 non-null     object
 1   prijimeni          27 non-null     object
 2   telefonni_cislo    27 non-null     object
 3   cislo_zamestnance  27 non-null     int64
 4   mesto              27 non-null     object
 5   date               27 non-null     object
 6   hours              27 non-null     float64
 7   project            27 non-null     object
dtypes: float64(1), int64(1), object(6)
memory usage: 1.9+ KB

dva ruzne pohledy: nejprve pres mesto a pote projekt, podruhe pres projekt a pote mesto

In [95]:
zamestnanci_projekty_nove.groupby(['mesto', 'project'])["hours"].sum()

mesto    project
Liberec  TE1        10.8
         W05         5.4
         YLI        11.8
Plzeň    F30        10.3
         YLI         5.3
Praha    F30        11.2
         JL9         2.1
         TE1         5.2
         W05        25.1
         YLI        13.9
Name: hours, dtype: float64

In [96]:
hodiny_mesto_projekt=zamestnanci_projekty_nove.groupby(['project', 'mesto'])["hours"].sum().reset_index()
#hodiny_mesto_projekt.info() # 10 zaznamu
hodiny_mesto_projekt

  project    mesto  hours
0     F30    Plzeň   10.3
1     F30    Praha   11.2
2     JL9    Praha    2.1
3     TE1  Liberec   10.8
4     TE1    Praha    5.2
5     W05  Liberec    5.4
6     W05    Praha   25.1
7     YLI  Liberec   11.8
8     YLI    Plzeň    5.3
9     YLI    Praha   13.9

chtela jsem jeste celkovy pohled, kde uvidim celkem hodin za projekt a po te po meste. Vzala jsem celkem_projekt (vytvorenou z vykazu viz povinna cast) - upravila jsem jmeno sloupce hours na celkem_hodin_projekt a hodiny_mesto_projekt viz vyse a spojila

In [97]:
celkem_projekt=celkem_projekt.rename(columns={'hours': 'celkem_hodin_projekt'}) # uprava jmena sloupce
celkem_projekt

  project  celkem_hodin_projekt
0     F30                  21.5
1     JL9                   2.1
2     TE1                  16.0
3     W05                  30.5
4     YLI                  31.0

slouceni celkem_projekt a hodiny_mesto_projekt pres projekt.......dotaz existuje je jednodussi zapis, kdyz chci pohled s castecnymi(celkovymi) soucty po jednotlivych sloupcich lepe receno hodnotach ve sloupcich..jako v tomto pripade soucet hodin za projekt ,ale i za mesto uvedenemu pod projektem?

In [98]:
vysledek = hodiny_mesto_projekt.merge(celkem_projekt, on='project', how="outer")
#vysledek.info() # 1O zaznamu odpovida 10 zaznamum v hodiny_mesto_project
vysledek

  project    mesto  hours  celkem_hodin_projekt
0     F30    Plzeň   10.3                  21.5
1     F30    Praha   11.2                  21.5
2     JL9    Praha    2.1                   2.1
3     TE1  Liberec   10.8                  16.0
4     TE1    Praha    5.2                  16.0
5     W05  Liberec    5.4                  30.5
6     W05    Praha   25.1                  30.5
7     YLI  Liberec   11.8                  31.0
8     YLI    Plzeň    5.3                  31.0
9     YLI    Praha   13.9                  31.0